local addonName, vm = ...;

if GetLocale() ~= "ruRU" then
    return
end

local L = {}
-- Translator ZamestoTV
L.ADDON_LOADED = "[%s] загружен."

L.HELP_ABOUT = "VendorMate\n\nСумки полны хлама? Эпические предметы старого мира прячутся на виду?\n\nНет проблем. Перейдите на вкладку \"Торговец\" и создайте несколько фильтров. Введите название фильтра в поле \"Добавить фильтр\" и нажмите Enter (или щёлкните на +). Затем вы можете настроить каждый фильтр для определённых предметов.\n\nФильтры имеют приоритет слева направо и сверху вниз. Это означает, что если предмет соответствует фильтрам 2 и 3, он будет отсортирован в фильтр 2, так как он находится выше.\n\nВы можете продавать фильтры по отдельности или все вместе, появится диалоговое окно с информацией и кнопкой подтверждения. Вы также можете выбрать автоматическое нажатие кнопки подтверждения в диалогах продажи."
L.AUTO_VENDOR_JUNK = "Автоматически продавать хлам"

L.TABS_VENDOR = "Торговец"
L.TABS_HISTORY = "История"
L.TABS_OPTIONS = "Настройки"

L.FILTER_BUTTON_SETTINGS_TT = "Настройки"
L.FILTER_BUTTON_VENDOR_TT = "Продать предметы"
L.FILTER_BUTTON_LOCK_TOGGLE_TT = "Переключить блокировку предмета"

L.DIALOG_VENDOR_CONFIRM = "Автоматически нажимать подтверждение предупреждений?"

L.VENDORING_OVERRIDE_POPUP_WARNING = string.format("%s %s", CreateAtlasMarkup("services-icon-warning", 25, 22), "Переопределение предупреждения торговца |cffFFD100Активно|r")

L.HELPTIP_VENDOR_FILTERS = string.format("Фильтры\n\nВы можете щёлкать по предметам в этом списке, чтобы переключать между продажей или игнорированием. Игнорируемые предметы не продаются.\n\n%s Настройки фильтра\n%s Удалить фильтр\n%s Переключить блокировку предмета\n%s Продать предметы",
    CreateAtlasMarkup("mechagon-projects", 16, 16),
    CreateAtlasMarkup("transmog-icon-remove", 16, 16),
    CreateAtlasMarkup("vignetteloot-locked", 16, 16),
    CreateAtlasMarkup("Banker", 16, 16)
)

L.HELPTIP_VENDOR_PROFILES = "Профили\n\nЗдесь вы можете выбрать профиль, чтобы быстро переключаться между системами продажи в зависимости от текущей игровой активности."

vm.locales = L;
